#+title: VocabQuery Readme
#+header-args: R :session s1 

* Installation

#+begin_src R :session s1 :exports none 

  devtools::load_all()
  
#+end_src

#+RESULTS:

#+begin_src R :session s1 :eval no 

  remotes::install_github("ob325/VocabQuery")
  
#+end_src

#+begin_src R :session s1 :exports code :results none

  library("Eunomia")
  library("knitr")
  library("dplyr") 
    
#+end_src

* Connect to the CDM

#+begin_src R :session s1 :results output 

  if (!exists("connectionDetails")) {
    connectionDetails <- Eunomia::getEunomiaConnectionDetails()
  } 

#+end_src

#+RESULTS:
: attempting to download GiBleed
: trying URL 'https://raw.githubusercontent.com/OHDSI/EunomiaDatasets/main/datasets/GiBleed/GiBleed_5.3.zip'
: Content type 'application/zip' length 6861852 bytes (6.5 MB)
: downloaded 6.5 MB
: 
: attempting to extract and load: C:\Users\WObrien8\AppData\Local\Temp\RtmpOuLMdk/GiBleed_5.3.zip to: C:\Users\WObrien8\AppData\Local\Temp\RtmpOuLMdk/GiBleed_5.3.sqlite

* Find concepts

I want to find the concept for RxNorm standard ingredient `celecoxib`.

#+begin_src R :session s1 :results output  :exports both 

    VocabQuery::queryConceptName(
                  connectionDetails,
                  schema = "main",
                  pattern = "celecox%",
                  domain = 'Drug',
                  vocab = 'RxNorm',
                  class = 'Ingredient')

#+end_src

#+RESULTS:
: Connecting using SQLite driver
: Error in VocabQuery::queryConceptName(connectionDetails, schema = "main",  (from queries.R#40) : 
:   object 'concept' not found

* Distinct values of columns

#+begin_src R :session s1 :results output  :exports both 

  VocabQuery::conceptTableDistinctValues(
                connectionDetails,
                column = "vocabulary_id",
                schema = "main")


#+end_src

#+RESULTS:
#+begin_example
Connecting using SQLite driver
  vocabulary_id
1           CVX
2        Gender
3       ICD10CM
4         LOINC
5           NDC
6          None
7        RxNorm
8        SNOMED
9         Visit
#+end_example

#+begin_src R :session s1 :results output  :exports both 

  VocabQuery::conceptTableDistinctValues(
                connectionDetails,
                column = "concept_class_id",
                schema = "main")


#+end_src

#+RESULTS:
#+begin_example
Connecting using SQLite driver
       concept_class_id
1          11-digit NDC
2   3-char nonbill code
3   4-char billing code
4          Branded Drug
5     Branded Drug Comp
6          Branded Pack
7                   CVX
8         Clinical Drug
9    Clinical Drug Comp
10     Clinical Finding
11 Clinical Observation
12    Context-dependent
13               Gender
14           Ingredient
15             Lab Test
16    Morph Abnormality
17            Procedure
18   Quant Branded Drug
19  Quant Clinical Drug
20            Undefined
21                Visit
#+end_example

* TODO Descendants of a standard concept

Note: Eunomia's concept table doesn't have a row for 75053 so we manually fill in the values below

#+begin_src R :session s1 :results output :exports both 

  VocabQuery::descendants(
                connectionDetails,
                schema = "main",
                conceptId = c(23746, 75053)) |>
    mutate(ancestor_concept_name = 'Fracture of bone') |>
    kable() 

#+end_src

#+RESULTS:
#+begin_example
Connecting using SQLite driver


| ancestor_concept_id|ancestor_concept_name | descendant_concept_id|descendant_concept_name                                 |
|-------------------:|:---------------------|---------------------:|:-------------------------------------------------------|
|               75053|Fracture of bone      |               4230399|Closed fracture of hip                                  |
|               75053|Fracture of bone      |               4059173|Fracture of ankle                                       |
|               75053|Fracture of bone      |               4048695|Fracture of vertebral column without spinal cord injury |
|               75053|Fracture of bone      |               4066995|Fracture of vertebral column with spinal cord injury    |
|               75053|Fracture of bone      |               4278672|Fracture of forearm                                     |
|               75053|Fracture of bone      |               4237458|Fracture of clavicle                                    |
|               75053|Fracture of bone      |              40480160|Pathological fracture due to osteoporosis               |
|               75053|Fracture of bone      |               4142905|Fracture of rib                                         |
|               75053|Fracture of bone      |               4134304|Fracture subluxation of wrist                           |
#+end_example
